<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Intro-to-Pandas" data-toc-modified-id="Intro-to-Pandas-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Intro to Pandas</a></span></li><li><span><a href="#Pandas-classes" data-toc-modified-id="Pandas-classes-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Pandas classes</a></span><ul class="toc-item"><li><span><a href="#Series" data-toc-modified-id="Series-2.1"><span class="toc-item-num">2.1&nbsp;&nbsp;</span>Series</a></span><ul class="toc-item"><li><span><a href="#__init__()" data-toc-modified-id="__init__()-2.1.1"><span class="toc-item-num">2.1.1&nbsp;&nbsp;</span>__init__()</a></span></li><li><span><a href="#Attributes" data-toc-modified-id="Attributes-2.1.2"><span class="toc-item-num">2.1.2&nbsp;&nbsp;</span>Attributes</a></span></li><li><span><a href="#Indexation" data-toc-modified-id="Indexation-2.1.3"><span class="toc-item-num">2.1.3&nbsp;&nbsp;</span>Indexation</a></span></li></ul></li><li><span><a href="#DataFrame" data-toc-modified-id="DataFrame-2.2"><span class="toc-item-num">2.2&nbsp;&nbsp;</span>DataFrame</a></span><ul class="toc-item"><li><span><a href="#__init__()" data-toc-modified-id="__init__()-2.2.1"><span class="toc-item-num">2.2.1&nbsp;&nbsp;</span>__init__()</a></span></li><li><span><a href="#Attributes" data-toc-modified-id="Attributes-2.2.2"><span class="toc-item-num">2.2.2&nbsp;&nbsp;</span>Attributes</a></span></li><li><span><a href="#Indexation" data-toc-modified-id="Indexation-2.2.3"><span class="toc-item-num">2.2.3&nbsp;&nbsp;</span>Indexation</a></span></li></ul></li></ul></li><li><span><a href="#Import/Export" data-toc-modified-id="Import/Export-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Import/Export</a></span><ul class="toc-item"><li><span><a href="#Import" data-toc-modified-id="Import-3.1"><span class="toc-item-num">3.1&nbsp;&nbsp;</span>Import</a></span></li><li><span><a href="#Export" data-toc-modified-id="Export-3.2"><span class="toc-item-num">3.2&nbsp;&nbsp;</span>Export</a></span></li><li><span><a href="#MySQL" data-toc-modified-id="MySQL-3.3"><span class="toc-item-num">3.3&nbsp;&nbsp;</span>MySQL</a></span></li></ul></li></ul></div>

# Intro to Pandas


<img src='https://ankane.org/images/daru.jpg'>

`Pandas` is one of the most famous libraries that any Python developer has used at least once. According to [wiki](https://en.wikipedia.org/wiki/Pandas_(software)), its development started in 2008, Pythoneers started using and spreading Pandas around 2012, but the first stable version was launched in **2020**! Seems to be quite late, but yeah, you only can launch stable version when it is stable! Nevertheless, by the launch date it was already super popular not only among pythoneers but also among pythonistas.

There are tons of articles about pandas being published online. Every day there is at least 1 new article about it. You can start scrolling [here](https://towardsdatascience.com/tagged/pandas) and it will take you a while until you finish with almost no time to read them (having in mind you need to pay for your subscription after 5th article in a month)... 

Long story short, Pandas is a Python library that provides extensive means for data analysis. The name is derived from the term "panel data", an econometrics term for data sets that include observations over multiple time periods for the same individuals.

Data analysts usually work with data coming from different sources. It can be .csv, .tsv, .txt, .xlsx or any other type of table formated data. It can be SQL database, NoSQL database, cloud storage or any other data storage. Most of them can be easily uploaded, processes, analyzed and exported back using Pandas. Most of the libraries use Pandas defined classes as default/optional format of data representation. In conjunction with Matplotlib and Seaborn, Pandas provides a wide range of opportunities for visual analysis of tabular data.

# Pandas classes

The main data structures in Pandas are implemented with Series and DataFrame classes. 

Series represents indexed one-dimensional array of some fixed data type. Given that, if you have a Series of integers (Series data type is `int32/int64`) and you add an empty row to it, Series data type will change to `float32/float64` (missing data is represented by `np.nan` which is float). We are going to talk about it later.

DataFrame is a two-dimensional data structure - a table - where each column contains data of the same type. You can see it as a dictionary of Series instances. DataFrames are great for representing real data: rows correspond to instances (examples, observations, etc.), and columns correspond to features of these instances.

## Series

Once again, Series is indexed one-dimensional array. Indexes don't need to be unique - there are cases when you actually need non-unique indexes. Series support both integer-based and label-based indexing, that allows to perform a huge amount of operations on Series.

In [67]:
import pandas as pd
pd.Series

pandas.core.series.Series

### \_\_init\_\_()

In [66]:
print(pd.Series.__doc__)

    One-dimensional ndarray with axis labels (including time series).

    Labels need not be unique but must be a hashable type. The object
    supports both integer- and label-based indexing and provides a host of
    methods for performing operations involving the index. Statistical
    methods from ndarray have been overridden to automatically exclude
    missing data (currently represented as NaN).

    Operations between Series (+, -, /, *, **) align values based on their
    associated index values-- they need not be the same length. The result
    index will be the sorted union of the two indexes.

    Parameters
    ----------
    data : array-like, Iterable, dict, or scalar value
        Contains data stored in Series.

        .. versionchanged:: 0.23.0
           If data is a dict, argument order is maintained for Python 3.6
           and later.

    index : array-like or Index (1d)
        Values must be hashable and have the same length as `data`.
        Non-unique index values are allowed. Will default to
        RangeIndex (0, 1, 2, ..., n) if not provided. If both a dict and index
        sequence are used, the index will override the keys found in the
        dict.
    dtype : str, numpy.dtype, or ExtensionDtype, optional
        Data type for the output Series. If not specified, this will be
        inferred from `data`.
        See the :ref:`user guide <basics.dtypes>` for more usages.
    name : str, optional
        The name to give to the Series.
    copy : bool, default False
        Copy input data.

As we can see, there is 1 mandatory argument which is `data` itself. Default index is provided if none is specified. You also can give a `name` for your Series object.

Let's create some Series!

In [8]:
# Series from list

l=list(range(-5,50,5))
l

pd.Series(l)

0     -5
1      0
2      5
3     10
4     15
5     20
6     25
7     30
8     35
9     40
10    45
dtype: int64

In [9]:
# could be done directly!

pd.Series(range(-5,50,5))

0     -5
1      0
2      5
3     10
4     15
5     20
6     25
7     30
8     35
9     40
10    45
dtype: int64

In [10]:
#Name can be given

pd.Series(range(-5,50,5), name='x5 numbers')

0     -5
1      0
2      5
3     10
4     15
5     20
6     25
7     30
8     35
9     40
10    45
Name: x5 numbers, dtype: int64

In [12]:
# Series with only 1 element can be created by passing a value itself
pd.Series(4)

0    4
dtype: int64

In [14]:
# can be derived from dictionary. Keys are indexes.
pd.Series({'apples':10,'cucumbers':3, 'bread':2, 'bacon':5, 'water':2}, name='picnic')

apples       10
cucumbers     3
bread         2
bacon         5
water         2
Name: picnic, dtype: int64

In [15]:
# if values of your dictionary are collections, collections will be stored as values of your Series
pd.Series({'a':[0,1,2,3,4,5],'b':[0,1,4,9,16,25],'c':[-1,-2,-3,-4,-5,-6]})

a          [0, 1, 2, 3, 4, 5]
b        [0, 1, 4, 9, 16, 25]
c    [-1, -2, -3, -4, -5, -6]
dtype: object

Let's save a Series to use later on.

In [18]:
s=pd.Series({'apples':10,'cucumbers':3, 'bread':2, 'bacon':5, \
             'water':5, 'sunscreen':1, 'baby wipes':1, 'bug spray':2, \
             'blanket':1, 'beer':10, 'wine':1, 'bottle opener':2, \
             'knife':1, 'towel':2, 'trash bags':5, 'ice packs':2, \
             'camera':1, 'board games':2}, name='picnic')

### Attributes

In [29]:
# data type of Series
s.dtype

dtype('int64')

In [30]:
# test on missing values
s.hasnans

False

In [31]:
# get index of Series
s.index

Index(['apples', 'cucumbers', 'bread', 'bacon', 'water', 'sunscreen',
       'baby wipes', 'bug spray', 'blanket', 'beer', 'wine', 'bottle opener',
       'knife', 'towel', 'trash bags', 'ice packs', 'camera', 'board games'],
      dtype='object')

In [32]:
# get data of Series
s.values

array([10,  3,  2,  5,  5,  1,  1,  2,  1, 10,  1,  2,  1,  2,  5,  2,  1,
        2])

In [35]:
# get number of rows
s.size

18

In [43]:
#check whether data is monotonically increase
display(s.is_monotonic_increasing)

# real case
display(pd.Series(range(10)).is_monotonic_increasing)

False

True

In [42]:
#check whether data is monotonically decrease
display(s.is_monotonic_decreasing)

# real case
display(pd.Series(range(10,1,-1)).is_monotonic_decreasing)

False

True

In [44]:
# number of dimensions
s.ndim

1

In [45]:
#get name
s.name

'picnic'

In [46]:
#check if empty
s.empty

False

### Indexation

When you want to access specific rows of your Series you can use several approaches

In [49]:
# get top n rows, default=5
s.head(n=10)

apples        10
cucumbers      3
bread          2
bacon          5
water          5
sunscreen      1
baby wipes     1
bug spray      2
blanket        1
beer          10
Name: picnic, dtype: int64

In [50]:
# get last n rows, default=5
s.tail(n=10)

blanket           1
beer             10
wine              1
bottle opener     2
knife             1
towel             2
trash bags        5
ice packs         2
camera            1
board games       2
Name: picnic, dtype: int64

In [104]:
# get n random rows
s.sample(n=2)

bread    2
bacon    5
Name: picnic, dtype: int64

In [52]:
#get value for specific row
s.apples

10

In [55]:
# get value for a list of rows
s[['knife', 'towel']]

knife    1
towel    2
Name: picnic, dtype: int64

In [56]:
# get value for a list of rows
s.loc[['knife', 'towel']]

knife    1
towel    2
Name: picnic, dtype: int64

In [60]:
# get value for a range of rows
s.loc['knife':'camera']

knife         1
towel         2
trash bags    5
ice packs     2
camera        1
Name: picnic, dtype: int64

In [63]:
# get value for a list of rows by index number
s.iloc[[1,5]]

cucumbers    3
sunscreen    1
Name: picnic, dtype: int64

In [61]:
# get value for a range of rows by index number
s.iloc[1:5]

cucumbers    3
bread        2
bacon        5
water        5
Name: picnic, dtype: int64

## DataFrame

Once again, DataFrame is indexed two-dimensional array. Each column represents a Serie. Therefore, Series and DataFrame share attributes and methods. We are going to discuss functionality of Series and DataFrames all the way through the bootcamp.

In [64]:
import pandas as pd
pd.DataFrame

pandas.core.frame.DataFrame

### \_\_init\_\_()

In [65]:
print(pd.DataFrame.__doc__)

    Two-dimensional, size-mutable, potentially heterogeneous tabular data.

    Data structure also contains labeled axes (rows and columns).
    Arithmetic operations align on both row and column labels. Can be
    thought of as a dict-like container for Series objects. The primary
    pandas data structure.

    Parameters
    ----------
    data : ndarray (structured or homogeneous), Iterable, dict, or DataFrame
        Dict can contain Series, arrays, constants, or list-like objects.

        .. versionchanged:: 0.23.0
           If data is a dict, column order follows insertion-order for
           Python 3.6 and later.

        .. versionchanged:: 0.25.0
           If data is a list of dicts, column order follows insertion-order
           for Python 3.6 and later.

    index : Index or array-like
        Index to use for resulting frame. Will default to RangeIndex if
        no indexing information part of input data and no index provided.
    columns : Index or array-like
        Column labels to use for resulting frame. Will default to
        RangeIndex (0, 1, 2, ..., n) if no column labels are provided.
    dtype : dtype, default None
        Data type to force. Only a single dtype is allowed. If None, infer.
    copy : bool, default False
        Copy data from inputs. Only affects DataFrame / 2d ndarray input.

    See Also
    --------
    DataFrame.from_records : Constructor from tuples, also record arrays.
    DataFrame.from_dict : From dicts of Series, arrays, or dicts.
    read_csv
    read_table
    read_clipboard

    Examples
    --------
    Constructing DataFrame from a dictionary.

    >>> d = {'col1': [1, 2], 'col2': [3, 4]}
    >>> df = pd.DataFrame(data=d)
    >>> df
       col1  col2
    0     1     3
    1     2     4

    Notice that the inferred dtype is int64.

    >>> df.dtypes
    col1    int64
    col2    int64
    dtype: object

    To enforce a single dtype:

    >>> df = pd.DataFrame(data=d, dtype=np.int8)
    >>> df.dtypes
    col1    int8
    col2    int8
    dtype: object

    Constructing DataFrame from numpy ndarray:

    >>> df2 = pd.DataFrame(np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]]),
    ...                    columns=['a', 'b', 'c'])
    >>> df2
       a  b  c
    0  1  2  3
    1  4  5  6
    2  7  8  9

Same as Series, there is 1 mandatory argument which is `data` itself. Default index is provided if none is specified. Default column names are also assigned if none is specified. 

Let's create some DataFrames!

In [68]:
# DataFrame from list

l=list(range(-5,50,5))
l

pd.DataFrame(l)

     0
0   -5
1    0
2    5
3   10
4   15
5   20
6   25
7   30
8   35
9   40
10  45

As we can see, default column name is numerical: 0,1,2,...

In [69]:
# could be done directly!

pd.DataFrame(range(-5,50,5))

     0
0   -5
1    0
2    5
3   10
4   15
5   20
6   25
7   30
8   35
9   40
10  45

In [71]:
#column name can be specified can be given

pd.DataFrame(range(-5,50,5), columns=['col1'])

    col1
0     -5
1      0
2      5
3     10
4     15
5     20
6     25
7     30
8     35
9     40
10    45

In [79]:
# can be derived from list of list

ll=[[i for i in range(j,j+5)] for j in range(10)]

pd.DataFrame(ll)

   0   1   2   3   4
0  0   1   2   3   4
1  1   2   3   4   5
2  2   3   4   5   6
3  3   4   5   6   7
4  4   5   6   7   8
5  5   6   7   8   9
6  6   7   8   9  10
7  7   8   9  10  11
8  8   9  10  11  12
9  9  10  11  12  13

In [77]:
# can be derived from dictionary where the values are collections. Keys are column names.
pd.DataFrame({'a':[0,1,2,3,4,5],'b':[0,1,4,9,16,25],'c':[-1,-2,-3,-4,-5,-6]})

   a   b  c
0  0   0 -1
1  1   1 -2
2  2   4 -3
3  3   9 -4
4  4  16 -5
5  5  25 -6

In [86]:
#More concrete example
colnames = ['LotSize','Neighborhood','YearBuilt','Quality','SalePrice']


house_dict = {'Baker House': [7420, 'BrkSide', 1939, 5, 118000],
              'Beazley House': [14115, 'Mitchel', 1993, 5, 143000],
              'Dominguez House': [14260, 'NoRidge', 2000, 8, 250000],
              'Hamilton House': [6120, 'OldTown', 1931, 7, 129900],
              'James House': [11250, 'CollgCr', 2001, 7, 223500],
              'Martinez House': [9600, 'Veenker', 1976, 6, 181500],
              'Roberts House': [9550, 'Crawfor', 1915, 7, 140000],
              'Smith House': [8450, 'CollgCr', 2003, 7, 208500],
              'Snyder House': [10084, 'Somerst', 2004, 8, 307000],
              'Zuckerman House': [10382, 'NWAmes', 1973, 7, 200000]}

display(pd.DataFrame(house_dict))

,Baker House,Beazley House,Dominguez House,Hamilton House,James House,Martinez House,Roberts House,Smith House,Snyder House,Zuckerman House
0,7420,14115,14260,6120,11250,9600,9550,8450,10084,10382
1,BrkSide,Mitchel,NoRidge,OldTown,CollgCr,Veenker,Crawfor,CollgCr,Somerst,NWAmes
2,1939,1993,2000,1931,2001,1976,1915,2003,2004,1973
3,5,5,8,7,7,6,7,7,8,7
4,118000,143000,250000,129900,223500,181500,140000,208500,307000,200000

As we can see, result sucks. Keys of dictionary should be indexes, not column names of dataframe.

In [88]:
# we can transpose it
display(pd.DataFrame(house_dict, index=colnames).T)

#or we can apply from_dict method of DataFrame
pd.DataFrame.from_dict(house_dict, orient='index', columns=colnames)

                LotSize Neighborhood YearBuilt Quality SalePrice
Baker House        7420      BrkSide      1939       5    118000
Beazley House     14115      Mitchel      1993       5    143000
Dominguez House   14260      NoRidge      2000       8    250000
Hamilton House     6120      OldTown      1931       7    129900
James House       11250      CollgCr      2001       7    223500
Martinez House     9600      Veenker      1976       6    181500
Roberts House      9550      Crawfor      1915       7    140000
Smith House        8450      CollgCr      2003       7    208500
Snyder House      10084      Somerst      2004       8    307000
Zuckerman House   10382       NWAmes      1973       7    200000

                 LotSize Neighborhood  YearBuilt  Quality  SalePrice
Baker House         7420      BrkSide       1939        5     118000
Beazley House      14115      Mitchel       1993        5     143000
Dominguez House    14260      NoRidge       2000        8     250000
Hamilton House      6120      OldTown       1931        7     129900
James House        11250      CollgCr       2001        7     223500
Martinez House      9600      Veenker       1976        6     181500
Roberts House       9550      Crawfor       1915        7     140000
Smith House         8450      CollgCr       2003        7     208500
Snyder House       10084      Somerst       2004        8     307000
Zuckerman House    10382       NWAmes       1973        7     200000

Let's save a Series to use later on.

In [89]:
df=pd.DataFrame.from_dict(house_dict, orient='index', columns=colnames)

### Attributes

In [90]:
# data type of each column
df.dtypes

LotSize          int64
Neighborhood    object
YearBuilt        int64
Quality          int64
SalePrice        int64
dtype: object

In [92]:
# get index of Series
df.index

Index(['Baker House', 'Beazley House', 'Dominguez House', 'Hamilton House',
       'James House', 'Martinez House', 'Roberts House', 'Smith House',
       'Snyder House', 'Zuckerman House'],
      dtype='object')

In [93]:
#get column names
df.columns

Index(['LotSize', 'Neighborhood', 'YearBuilt', 'Quality', 'SalePrice'], dtype='object')

In [94]:
# get data of DataFrame
df.values

array([[7420, 'BrkSide', 1939, 5, 118000],
       [14115, 'Mitchel', 1993, 5, 143000],
       [14260, 'NoRidge', 2000, 8, 250000],
       [6120, 'OldTown', 1931, 7, 129900],
       [11250, 'CollgCr', 2001, 7, 223500],
       [9600, 'Veenker', 1976, 6, 181500],
       [9550, 'Crawfor', 1915, 7, 140000],
       [8450, 'CollgCr', 2003, 7, 208500],
       [10084, 'Somerst', 2004, 8, 307000],
       [10382, 'NWAmes', 1973, 7, 200000]], dtype=object)

In [97]:
# get shape - (# rows, #columns)
df.shape

(10, 5)

In [98]:
#get number of cells in the table
df.size

50

In [99]:
# number of dimensions
df.ndim

2

### Indexation

When you want to access specific rows of your Series you can use several approaches

In [101]:
# get top n rows, default=5
df.head(n=4)

                 LotSize Neighborhood  YearBuilt  Quality  SalePrice
Baker House         7420      BrkSide       1939        5     118000
Beazley House      14115      Mitchel       1993        5     143000
Dominguez House    14260      NoRidge       2000        8     250000
Hamilton House      6120      OldTown       1931        7     129900

In [102]:
# get last n rows, default=5
s.tail(n=4)

trash bags     5
ice packs      2
camera         1
board games    2
Name: picnic, dtype: int64

In [105]:
# get n random rows
df.sample(n=4)

               LotSize Neighborhood  YearBuilt  Quality  SalePrice
Smith House       8450      CollgCr       2003        7     208500
James House      11250      CollgCr       2001        7     223500
Snyder House     10084      Somerst       2004        8     307000
Beazley House    14115      Mitchel       1993        5     143000

In [108]:
# select specific column
display(df.Quality)
print()
# or this way
df['Quality']

Baker House        5
Beazley House      5
Dominguez House    8
Hamilton House     7
James House        7
Martinez House     6
Roberts House      7
Smith House        7
Snyder House       8
Zuckerman House    7
Name: Quality, dtype: int64

Baker House        5
Beazley House      5
Dominguez House    8
Hamilton House     7
James House        7
Martinez House     6
Roberts House      7
Smith House        7
Snyder House       8
Zuckerman House    7
Name: Quality, dtype: int64

In [109]:
# get list of columns
df[['LotSize', 'Quality']]

                 LotSize  Quality
Baker House         7420        5
Beazley House      14115        5
Dominguez House    14260        8
Hamilton House      6120        7
James House        11250        7
Martinez House      9600        6
Roberts House       9550        7
Smith House         8450        7
Snyder House       10084        8
Zuckerman House    10382        7

In [113]:
# get specific row
df.loc['Beazley House']

LotSize           14115
Neighborhood    Mitchel
YearBuilt          1993
Quality               5
SalePrice        143000
Name: Beazley House, dtype: object

In [114]:
#get a list of rows
df.loc[['Beazley House', 'Snyder House']]

               LotSize Neighborhood  YearBuilt  Quality  SalePrice
Beazley House    14115      Mitchel       1993        5     143000
Snyder House     10084      Somerst       2004        8     307000

In [115]:
# get specific rows and columns
df.loc[['Beazley House', 'Snyder House'], ['LotSize', 'Quality']]

               LotSize  Quality
Beazley House    14115        5
Snyder House     10084        8

In [118]:
# get specific range of rows 
df.loc['Beazley House':'Martinez House']

                 LotSize Neighborhood  YearBuilt  Quality  SalePrice
Beazley House      14115      Mitchel       1993        5     143000
Dominguez House    14260      NoRidge       2000        8     250000
Hamilton House      6120      OldTown       1931        7     129900
James House        11250      CollgCr       2001        7     223500
Martinez House      9600      Veenker       1976        6     181500

In [120]:
# get specific range of rows and columns 
df.loc['Beazley House':'Martinez House', 'LotSize':'YearBuilt']

                 LotSize Neighborhood  YearBuilt
Beazley House      14115      Mitchel       1993
Dominguez House    14260      NoRidge       2000
Hamilton House      6120      OldTown       1931
James House        11250      CollgCr       2001
Martinez House      9600      Veenker       1976

In [121]:
# get specific range of columns 
df.loc[:, 'LotSize':'YearBuilt'] #column specifies all rows

                 LotSize Neighborhood  YearBuilt
Baker House         7420      BrkSide       1939
Beazley House      14115      Mitchel       1993
Dominguez House    14260      NoRidge       2000
Hamilton House      6120      OldTown       1931
James House        11250      CollgCr       2001
Martinez House      9600      Veenker       1976
Roberts House       9550      Crawfor       1915
Smith House         8450      CollgCr       2003
Snyder House       10084      Somerst       2004
Zuckerman House    10382       NWAmes       1973

In [123]:
# get specific row by index number
df.iloc[1]

LotSize           14115
Neighborhood    Mitchel
YearBuilt          1993
Quality               5
SalePrice        143000
Name: Beazley House, dtype: object

In [124]:
#get a list of rows by index number
df.iloc[[1, -2]]

               LotSize Neighborhood  YearBuilt  Quality  SalePrice
Beazley House    14115      Mitchel       1993        5     143000
Snyder House     10084      Somerst       2004        8     307000

In [126]:
# get specific rows and columns by index number
df.iloc[[1, -2], [0, -2]]

               LotSize  Quality
Beazley House    14115        5
Snyder House     10084        8

In [127]:
# get specific range of rows by index number
df.iloc[1:6]

                 LotSize Neighborhood  YearBuilt  Quality  SalePrice
Beazley House      14115      Mitchel       1993        5     143000
Dominguez House    14260      NoRidge       2000        8     250000
Hamilton House      6120      OldTown       1931        7     129900
James House        11250      CollgCr       2001        7     223500
Martinez House      9600      Veenker       1976        6     181500

In [129]:
# get specific range of rows and columns by index number
df.iloc[1:6, 0:3]

                 LotSize Neighborhood  YearBuilt
Beazley House      14115      Mitchel       1993
Dominguez House    14260      NoRidge       2000
Hamilton House      6120      OldTown       1931
James House        11250      CollgCr       2001
Martinez House      9600      Veenker       1976

In [131]:
# get specific range of columns 
df.iloc[:, :3] #column specifies all rows

                 LotSize Neighborhood  YearBuilt
Baker House         7420      BrkSide       1939
Beazley House      14115      Mitchel       1993
Dominguez House    14260      NoRidge       2000
Hamilton House      6120      OldTown       1931
James House        11250      CollgCr       2001
Martinez House      9600      Veenker       1976
Roberts House       9550      Crawfor       1915
Smith House         8450      CollgCr       2003
Snyder House       10084      Somerst       2004
Zuckerman House    10382       NWAmes       1973

# Import/Export

For the sake of simplicity, we are going to import and export the same dataset that was saved in different formats. 

Download zip archive from [here](https://s3-eu-west-1.amazonaws.com/ih-materials/uploads/data-static/data/module-1/vehicles.zip), unzip it and locate yourself to the folder using os library. You should see the following extracted files:

vehicles_messy.csv  
vehicles_pipe.txt  
vehicles_tab.txt  
vehicles.csv  
vehicles.json  
vehicles.xlsx

In [134]:
import os

os.chdir('/home/mauritian/Downloads/vehicles/')

In [135]:
os.listdir()

['vehicles.xlsx',
 'vehicles.csv',
 'vehicles_pipe.txt',
 'vehicles_messy.csv',
 'vehicles.json',
 'vehicles_tab.txt']

## Import

Every type of text files (with detectable separator) that you could open using Excel, can be loaded using `read_csv` method of `pandas`.

In [137]:
# Import comma-separated variable file
data = pd.read_csv('vehicles.csv')
data.head()

,Make,Model,Year,Engine Displacement,Cylinders,Transmission,Drivetrain,Vehicle Class,Fuel Type,Fuel Barrels/Year,City MPG,Highway MPG,Combined MPG,CO2 Emission Grams/Mile,Fuel Cost/Year
0,AM General,DJ Po Vehicle 2WD,1984,2.5,4.0,Automatic 3-spd,2-Wheel Drive,Special Purpose Vehicle 2WD,Regular,19.388824,18,17,17,522.764706,1950
1,AM General,FJ8c Post Office,1984,4.2,6.0,Automatic 3-spd,2-Wheel Drive,Special Purpose Vehicle 2WD,Regular,25.354615,13,13,13,683.615385,2550
2,AM General,Post Office DJ5 2WD,1985,2.5,4.0,Automatic 3-spd,Rear-Wheel Drive,Special Purpose Vehicle 2WD,Regular,20.600625,16,17,16,555.437500,2100
3,AM General,Post Office DJ8 2WD,1985,4.2,6.0,Automatic 3-spd,Rear-Wheel Drive,Special Purpose Vehicle 2WD,Regular,25.354615,13,13,13,683.615385,2550
4,ASC Incorporated,GNX,1987,3.8,6.0,Automatic 4-spd,Rear-Wheel Drive,Midsize Cars,Premium,20.600625,14,21,16,555.437500,2550

In [138]:
# Import tab-delimited file
data = pd.read_csv('vehicles_tab.txt', sep='\t')
data.head()

,Make,Model,Year,Engine Displacement,Cylinders,Transmission,Drivetrain,Vehicle Class,Fuel Type,Fuel Barrels/Year,City MPG,Highway MPG,Combined MPG,CO2 Emission Grams/Mile,Fuel Cost/Year
0,AM General,DJ Po Vehicle 2WD,1984,2.5,4.0,Automatic 3-spd,2-Wheel Drive,Special Purpose Vehicle 2WD,Regular,19.388824,18,17,17,522.764706,1950
1,AM General,FJ8c Post Office,1984,4.2,6.0,Automatic 3-spd,2-Wheel Drive,Special Purpose Vehicle 2WD,Regular,25.354615,13,13,13,683.615385,2550
2,AM General,Post Office DJ5 2WD,1985,2.5,4.0,Automatic 3-spd,Rear-Wheel Drive,Special Purpose Vehicle 2WD,Regular,20.600625,16,17,16,555.437500,2100
3,AM General,Post Office DJ8 2WD,1985,4.2,6.0,Automatic 3-spd,Rear-Wheel Drive,Special Purpose Vehicle 2WD,Regular,25.354615,13,13,13,683.615385,2550
4,ASC Incorporated,GNX,1987,3.8,6.0,Automatic 4-spd,Rear-Wheel Drive,Midsize Cars,Premium,20.600625,14,21,16,555.437500,2550

In [139]:
# Import pipe-delimited file
data = pd.read_csv('vehicles_pipe.txt', sep='|')
data.head()

,Make,Model,Year,Engine Displacement,Cylinders,Transmission,Drivetrain,Vehicle Class,Fuel Type,Fuel Barrels/Year,City MPG,Highway MPG,Combined MPG,CO2 Emission Grams/Mile,Fuel Cost/Year
0,AM General,DJ Po Vehicle 2WD,1984,2.5,4.0,Automatic 3-spd,2-Wheel Drive,Special Purpose Vehicle 2WD,Regular,19.388824,18,17,17,522.764706,1950
1,AM General,FJ8c Post Office,1984,4.2,6.0,Automatic 3-spd,2-Wheel Drive,Special Purpose Vehicle 2WD,Regular,25.354615,13,13,13,683.615385,2550
2,AM General,Post Office DJ5 2WD,1985,2.5,4.0,Automatic 3-spd,Rear-Wheel Drive,Special Purpose Vehicle 2WD,Regular,20.600625,16,17,16,555.437500,2100
3,AM General,Post Office DJ8 2WD,1985,4.2,6.0,Automatic 3-spd,Rear-Wheel Drive,Special Purpose Vehicle 2WD,Regular,25.354615,13,13,13,683.615385,2550
4,ASC Incorporated,GNX,1987,3.8,6.0,Automatic 4-spd,Rear-Wheel Drive,Midsize Cars,Premium,20.600625,14,21,16,555.437500,2550

When it comes to .xslx files, `read_excel` becomes handy.

In [140]:
data = pd.read_excel('vehicles.xlsx')
data.head()

,Make,Model,Year,Engine Displacement,Cylinders,Transmission,Drivetrain,Vehicle Class,Fuel Type,Fuel Barrels/Year,City MPG,Highway MPG,Combined MPG,CO2 Emission Grams/Mile,Fuel Cost/Year
0,AM General,DJ Po Vehicle 2WD,1984,2.5,4,Automatic 3-spd,2-Wheel Drive,Special Purpose Vehicle 2WD,Regular,19.388824,18,17,17,522.764706,1950
1,AM General,FJ8c Post Office,1984,4.2,6,Automatic 3-spd,2-Wheel Drive,Special Purpose Vehicle 2WD,Regular,25.354615,13,13,13,683.615385,2550
2,AM General,Post Office DJ5 2WD,1985,2.5,4,Automatic 3-spd,Rear-Wheel Drive,Special Purpose Vehicle 2WD,Regular,20.600625,16,17,16,555.437500,2100
3,AM General,Post Office DJ8 2WD,1985,4.2,6,Automatic 3-spd,Rear-Wheel Drive,Special Purpose Vehicle 2WD,Regular,25.354615,13,13,13,683.615385,2550
4,ASC Incorporated,GNX,1987,3.8,6,Automatic 4-spd,Rear-Wheel Drive,Midsize Cars,Premium,20.600625,14,21,16,555.437500,2550

You could notice the file loading time difference. The same data is loaded much faster when saved as txt/csv. Keep that in mind when you need to save some data.

When it comes to JSON (JavaScript Object Notation) files, you simply consider them as dictionaries.

In [141]:
data=pd.read_json('vehicles.json', orient='records')
data.head()

,Make,Model,Year,Engine Displacement,Cylinders,Transmission,Drivetrain,Vehicle Class,Fuel Type,Fuel Barrels/Year,City MPG,Highway MPG,Combined MPG,CO2 Emission Grams/Mile,Fuel Cost/Year
0,AM General,DJ Po Vehicle 2WD,1984,2.5,4,Automatic 3-spd,2-Wheel Drive,Special Purpose Vehicle 2WD,Regular,19.388824,18,17,17,522.764706,1950
1,AM General,FJ8c Post Office,1984,4.2,6,Automatic 3-spd,2-Wheel Drive,Special Purpose Vehicle 2WD,Regular,25.354615,13,13,13,683.615385,2550
2,AM General,Post Office DJ5 2WD,1985,2.5,4,Automatic 3-spd,Rear-Wheel Drive,Special Purpose Vehicle 2WD,Regular,20.600625,16,17,16,555.437500,2100
3,AM General,Post Office DJ8 2WD,1985,4.2,6,Automatic 3-spd,Rear-Wheel Drive,Special Purpose Vehicle 2WD,Regular,25.354615,13,13,13,683.615385,2550
4,ASC Incorporated,GNX,1987,3.8,6,Automatic 4-spd,Rear-Wheel Drive,Midsize Cars,Premium,20.600625,14,21,16,555.437500,2550

Note that we set the orient parameter to 'records' in our code examples above. We did this because our JSON file was structured as a list of dictionaries where each dictionary represented a complete record of data. When working with JSON files in Pandas, the way the data is organized is going to dictate the value you pass to the orient parameter. Below are a few other common ways that JSON files can be structured and the corresponding value you should pass to the orient parameter for each one.

* 'split': Dictionary containing indexes, columns, and data.  
* 'index': Nested dictionaries containing {index:{column:value}}.  
* 'columns': Nested dictionaries containing {column:{index:value}}  
* 'values': Nested list where each sublist contains the values for a record.  
* 'table': Nested dictionaries containing schema and data (records).

## Export

In order to export your DataFrame/Series into text file, you can use `to_csv` method, specifying the separator with `sep` argument and indicating whether or not you want to keep index in your text file.

In [142]:
# Export comma-separated variable file
data.to_csv('vehicles_new.csv', index=False)

# Export tab-delimited file
data.to_csv('vehicles_tab_new.txt', sep='\t', index=False)

# Export pipe-delimited file
data.to_csv('vehicles_pipe_new.txt', sep='|', index=False)

As for Excel - `to_excel` should work fine

In [143]:
data.to_excel('vehicles_new.xlsx', index=False)

And yeah, JSON - `to_json`. Don't forget to specify the orientation that you actually need.

In [145]:
data.to_json('vehicles_new.json', orient='records')

We can take a look to check whether files are saved.

In [147]:
sorted(os.listdir())

['vehicles.csv',
 'vehicles.json',
 'vehicles.xlsx',
 'vehicles_messy.csv',
 'vehicles_new.csv',
 'vehicles_new.json',
 'vehicles_new.xlsx',
 'vehicles_pipe.txt',
 'vehicles_pipe_new.txt',
 'vehicles_tab.txt',
 'vehicles_tab_new.txt']

## MySQL

When it comes to MySQL, you need to keep in mind that you can:
- Import a MySQL table into Pandas DataFrame
- Run a query to select specific data, including aggregated data and then send them into Pandas DataFrame

In order to get your data, you need to connect to MySQL server. `pymysql` and `sqlalchemy` libraries allow us to do it in a simple and fast way.

In [149]:
!pip install pymysql

Collecting pymysql
  Downloading PyMySQL-0.9.3-py2.py3-none-any.whl (47 kB)
     |████████████████████████████████| 47 kB 1.1 MB/s eta 0:00:011
Installing collected packages: pymysql
Successfully installed pymysql-0.9.3

In [150]:
import pymysql
from sqlalchemy import create_engine

In [175]:
#this credentials won't work for you, change them!
username='root'
password='password'
server='localhost'
database='publications'

In [176]:
engine = create_engine(f'mysql+pymysql://{username}:{password}@{server}/{database}')

In [177]:
data = pd.read_sql_query('SELECT * FROM publications.employee', engine)

In [179]:
data.head()

      emp_id    fname minit      lname  job_id  job_lvl pub_id  hire_date
0  A-C71970F     Aria             Cruz      10       87   1389 1991-10-26
1  A-R89858F  Annette           Roulet       6      152   9999 1990-02-21
2  AMD15433F      Ann     M      Devon       3      200   9952 1991-07-16
3  ARD36773F  Anabela     R  Domingues       8      100   0877 1993-01-27
4  CFH28514M   Carlos     F   Hernadez       5      211   9999 1989-04-21

As you can see, we created a connector (`engine`) to our MySQL server and then ran query on it. Output of the query was saved into our Pandas DataFrame.

Now let's send our dataframe back to SQL.

In [180]:
data.to_sql(name='employee_new',con=engine, if_exists='replace',index=False)

As you can see, the first argument of `to_sql` is the `name` of new table. Second argument is the connector.  
`if_exists` stands for the action needed to be done if table with given `name` already exists.  
`index` is up to you - do you want to keep the index as column or you want to drop it.

In [185]:
from sqlalchemy import inspect
inspector = inspect(engine)
inspector.get_table_names()

['authors',
 'discounts',
 'employee',
 'employee_new',
 'jobs',
 'pub_info',
 'publishers',
 'roysched',
 'sales',
 'stores',
 'titleauthor',
 'titles']

The `inspect` subclass of `engine` can show us the structure of the MySQL database we are connected to via connector. Here we can see that `employee_new` table has appeared.